;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

;; (package! cnfonts)
(package! cal-china-x)
(package! org2blog)
(package! pangu-spacing :disable t)
(package! org-pomodoro)
(package! counsel-org-clock)
(package! company-tabnine)
(package! posframe)
(package! alert)
(package! symbol-overlay)
(package! exec-path-from-shell)
